{
  "description": "Desarrollador Frontend: Construyendo Aplicaciones Web Escalables y Atractivas",
  "experience": "Con 2 años de experiencia en React y TypeScript, creo aplicaciones web responsivas y fáciles de usar que ofrecen experiencias de usuario excepcionales.",
  "get_in_touch": "Ponte en contacto",
  "view_my_work": "Mira mi trabajo",

  "about_me": "Sobre mí",
  "first_text_about_me": "Soy un apasionado Desarrollador Frontend con un fuerte enfoque en la creación de aplicaciones web intuitivas y de alto rendimiento. Con 2 años de experiencia en React y TypeScript, he desarrollado una comprensión profunda de las tecnologías frontend modernas y las mejores prácticas.",
  "second_text_about_me": "Mi enfoque combina experiencia técnica con un gran sentido del diseño, lo que me permite crear aplicaciones que no solo son funcionales, sino también visualmente atractivas y fáciles de usar. Destaco en la optimización de experiencias de usuario, el trabajo con APIs y la colaboración en equipos ágiles.",
  "third_text_about_me": "Estoy en constante aprendizaje y explorando nuevas tecnologías para mantenerme a la vanguardia del desarrollo web. Mi objetivo es crear aplicaciones web que generen un impacto positivo y ofrezcan experiencias de usuario excepcionales.",

  "professional_experience": "Experiencia Profesional",
  "my_journey_frontend_developer": "Mi Trayectoria como Desarrollador Frontend",
  "frontend_developer": "Desarrollador Frontend",
  "january_2023": "Enero 2023",
  "present": "Presente",
  "enhanced_ui_material_ui": "Interfazes de usuario mejoradas usando Material UI, lo que resultó en una mejora del 30% en las métricas de interacción del usuario.",
  "implemented_redux_state_management": "Implementé Redux para la gestión de estado, mejorando el rendimiento y la mantenibilidad de la aplicación.",
  "utilized_react_router_navigation": "Utilicé React Router para una navegación fluida, reduciendo los tiempos de carga de página en un 25%.",
  "collaborated_backend_restful_apis": "Colaboré con desarrolladores backend para integrar APIs RESTful, asegurando un flujo de datos fluido entre los sistemas frontend y backend.",
  "participated_agile_processes": "Participé en procesos de desarrollo ágil, contribuyendo a la planificación de sprints, reuniones diarias y retrospectivas.",
  "optimized_app_performance": "Optimicé el rendimiento de la aplicación a través de refactorización de código e implementación de buenas prácticas.",
  "web_master_developer": "Desarrollador Web Master",
  "web_master_trayectory": "Julio 2020 - Diciembre 2022",
  "worked_with_no_code_tools": "Trabajé con herramientas no-code como WordPress, Shopify y Webflow para ofrecer soluciones web innovadoras",
  "developed_wp_wpbakery": "Desarrollé proyectos en WordPress utilizando el constructor de páginas WPBakery y temas premium como Salient, creando diseños modernos y personalizados.",
  "build_minisites_kcp": "Construí mini-sitios para Kimberly Clark Professional utilizando HTML, CSS y JavaScript, creando experiencias digitales atractivas.",
  "responsive_email_templates": "Codifiqué plantillas de correo electrónico para campañas de marketing.",

  "skills_and_technologies": "Habilidades y Tecnologías",
  "tools_and_technologies": "Las herramientas y tecnologías con las que trabajo",
  "frontend": "Frontend",
  "frontend_description": "Tecnologías para construir interfaces de usuario",
  "tools_and_workflow": "Herramientas y Flujo de trabajo",
  "tools_and_workflow_description": "Herramientas y procesos de desarrollo",
  "backend_and_deployment": "Backend y Despliegue",
  "backend_and_deployment_description": "Tecnologías del lado del servidor y despliegue",

  "featured_projects": "Proyectos Destacados",
  "featured_projects_description": "Una selección de mi trabajo reciente",
  "journal_app": "Aplicación de Diario",
  "journal_app_description": "Una aplicación de diario completa construida con React, Material UI y Redux. Integra Firebase para servicios de backend y autenticación de Google, y usa Cloudinary para la subida de imágenes. La aplicación permite a los usuarios crear, editar y eliminar entradas de diario fácilmente, proporcionando una experiencia de usuario fluida e intuitiva.",
  "search_gifs": "Buscar Gifs",
  "search_gifs_description": "Una aplicación interactiva de búsqueda de GIFs utilizando la API de Giphy. Construida con React, incluye una función de búsqueda dinámica que permite a los usuarios encontrar y mostrar GIFs según palabras clave, mejorando la experiencia del usuario con retroalimentación visual instantánea.",
  "heroes_spa": "Heroes SPA",
  "heroes_spa_description": "Heroes SPA es una aplicación de una sola página construida con React y React Router DOM. Presenta una colección de héroes de DC y Marvel, permitiendo a los usuarios explorar y buscar sus personajes favoritos. La aplicación también incluye una funcionalidad básica de inicio y cierre de sesión para demostrar flujos de autenticación en un entorno React.",
  "code": "Código",
  "live_demo": "Demo en Vivo"


}